Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: Similarly, its second case matches all lowercase English consonants.
ja: 同じように、その第二のケース節は、小文字の英語の子音すべてにマッチします。

source: Similarly, the SnakesAndLadders game class can be extended to adopt and conform to the TextRepresentable protocol:
ja: 同じように、SnakesAndLaddersゲーム・クラスは、拡張されることで、TextRepresentableプロトコルを採用して準拠することができます：

source: Similarly, the green component is obtained by performing a bitwise AND between the numbers 0xCC6699 and 0x00FF00, which gives an output value of 0x006600.
ja: 同じように、緑の構成要素は数0xCC6699と0x00FF00との間のビット単位の論理積を実行することによって得られます、それは、0x006600の出力値を与えます。

source: Similarly, the second case, case (0, let y), matches any point with an x value of 0 and assigns the point’s y value to the temporary constant y.
ja: 同じように、第二のケース節、case (0, let y)は、0のx値をもつどんなポイントにでも適合して、そのポイントのy値を一時的な定数yに代入します。

source: Similarly, the ternary conditional operator (a ? b : c) can’t be overloaded.
ja: 同じように三項条件演算子（a ? b : c)は、オーバーロードされることができません。

source: Similarly, there are 3.28084 feet in a meter, and so the ft computed property divides the underlying Double value by 3.28084, to convert it from feet to meters.
ja: 同じように、１メートルは3.28084フィートあります、なのでft計算プロパティは、もとのDouble値を3.28084で割って、それをフィートからメートルに変換します。

source: Similarly, type methods on structures and enumerations can access type properties by using the type property’s name without a type name prefix.
ja: 同じように、構造体と列挙の型メソッドは、型名前接頭辞なしで型プロパティの名前を使用することによって型プロパティにアクセスすることができます。

source: Similarly, use the hasSuffix(_:) method to count the number of scenes that take place in or around Capulet’s mansion and Friar Lawrence’s cell:
ja: 同じように、hasSuffix(_:)メソッドを、キャビュレットの邸宅と修道士ローレンスの独居房の中または周囲で起こる場面の数を数えるために使用してください：

source: Similarly, you can create a dictionary to store values of any specified type, and there are no limitations on what that type can be.
ja: 同じように、あなたはどんな指定された型の値たちでも保管する辞書を作成することができます、そしてその型が何であることができるか制限がありません。

source: Similarly, you can omit part of a type when the full type can be inferred from context.
ja: 同じように、前後関係から完全に型が推論されることができるとき、あなたはある型の一部を省略することができます。

source: Similarly, you can try to set a new value through a subscript with optional chaining:
ja: 同じように、あなたはオプショナル連鎖を使う添え字を通して、新しい値の設定を試みることができます：

source: Similarly, you remove an item from the array with the remove(at:) method.
ja: 同じように、あなたはremove(at:)メソッドを使って配列から項目を取り除きます。

source: Simple Values
ja: 単純な値

source: Simple statements are the most common and consist of either an expression or a declaration.
ja: 単純な文は、もっとも普通のもので、ひとつの式もしくはひとつの宣言から成ります。

source: Single line comments begin with // and continue until a line feed (U+000A) or carriage return (U+000D).
ja: 一行コメントは//で始まります、そして行送り（U+000A）または復帰（U+000D）まで続きます。

source: Single quotation mark (\')
ja: 一重引用符（\'０

source: Single statement closures implicitly return the value of their only statement.
ja: ひとつだけの文のクロージャは、暗黙のうちにそのただ１つの文の値を返します。

source: Single-expression closures can implicitly return the result of their single expression by omitting the return keyword from their declaration, as in this version of the previous example:
ja: 単一の式のクロージャは、前の例のこの改作のように、returnキーワードをそれらの宣言から省略することによって、暗黙的にそれのただ１つの式の結果を返すことができます：

source: Some declaration attributes accept arguments that specify more information about the attribute and how it applies to a particular declaration.
ja: 若干の宣言属性は、属性に関するより多くの情報とそれが特定の宣言に適用される方法を指定する引数を受け入れます。

source: Some operations aren’t guaranteed to always complete execution or produce a useful output.
ja: いくつかの操作は、常に実行を完了することや役に立つ出力を生成することを保証されません。

source: Some products are labeled with 1D barcodes in UPC format, which uses the numbers 0 to 9.
ja: ある製品はUPC形式の一次元バーコードでラベルをつけられます、それは0から9までの数字を使います。

source: Some squares are then set to have more specific values for the snakes and ladders.
ja: いくつかの正方形は、それからヘビとはしごのためのより独特な値を持つように設定されます。

source: Some users might want fewer tick marks in their UI.
ja: 幾人かのユーザは、より少ない目盛りを彼らのUIに望むかもしれません。

source: Something similar happens when an unsigned integer is allowed to overflow in the negative direction.
ja: 符号なし整数が負の向きにおいてオーバフローを認められるときに同じようなことが起こります。

source: Sometimes it’s clear from a program’s structure that an optional will always have a value, after that value is first set.
ja: 時々、プログラムの構造から、あるオプショナルが必ず値を持つことが、その値が最初に設定される結果として、はっきりしていることがあります。

source: Sometimes you know a throwing function or method won’t, in fact, throw an error at runtime.
ja: 時にはあなたはあるスロー関数またはメソッドが、実際のところ、実行時にエラーをスローすることがないのを知っています。

source: Special Characters in String Literals
ja: 文字列リテラル内の特別な文字

source: Special Kinds of Methods
ja: 特別な種類のメソッド

source: Special Kinds of Parameters
ja: 特別な種類のパラメータ

source: Special characters can be included in string literals of both the single-line and multiline forms using the following escape sequences:
ja: 特殊文字は、単一行および複数行形式の両方の文字列リテラルの中に以下のエスケープシーケンスを使って含められます：

source: Special characters in a string delimited by extended delimiters appear in the resulting string as normal characters rather than as special characters.
ja: 拡張区切り記号によって区切られた文字列は、結果文字列において普通の文字として現れます、特殊文字としてではなく。

source: Specifically, a conflict occurs if you have two accesses that meet all of the following conditions:
ja: とりわけ、あなたが２つのアクセスを持ち以下の条件のすべてに出会う場合に、ある衝突が起こります：

source: Specifically, if a failable initializer delegates to an initializer that fails and returns nil, then the initializer that delegated also fails and implicitly returns nil.
ja: 具体的には、失敗できるイニシャライザが、ある失敗してnilを返すイニシャライザへ委任するならば、その時その委任した側のイニシャライザもまた失敗して暗黙的にnilを返します。

source: Specifically, it can prove that overlapping access to properties of a structure is safe if the following conditions apply:
ja: とりわけ、関数のプロパティに対するオーバーラップアクセスが安全であることは、以下の条件が当てはまるならば立証できます：

source: Specifically, it declares a name property of type String, and an init name initializer.
ja: 特に、それは型Stringのnameプロパティ、そしてinit nameイニシャライザを宣言します。

source: Specifically, it expresses whether the number is negative, zero, or positive.
ja: 具体的には、それはその数が負、ゼロ、または正かを表わします。

source: Specifically, it must ensure that only items of the right type are added to the container, and it must be clear about the type of the items returned by its subscript.
ja: 具体的には、それは正しい型の項目だけがコンテナに加えられることを確実にしなければなりません、そして、それはそれの添え字によって返される項目の型についてはっきりわかっていなければなりません。

source: Specifically, the property observer chooses a gear that is the new currentSpeed value divided by 10, rounded down to the nearest integer, plus 1.
ja: 具体的には、プロパティオブザーバーは、新しいcurrentSpeed値を10で割って、最も近い整数に丸めて、1を加えたギアを選びます。

source: Specifically, the result of an optional chaining call is of the same type as the expected return value, but wrapped in an optional.
ja: 具体的には、オプショナル連鎖の呼び出しの結果は、期待される戻り値と同じ型ですが、オプショナルの中にラップされています。

source: Specifically, you can use a key path expression whose root type is SomeType and whose path produces a value of type Value, instead of a function or closure of type (SomeType) -> Value.
ja: とりわけ、あなたはそれのルート型がSomeTypeでそれのパスが型Valueの値を生み出すキーパス式を、型(SomeType) -> Valueの関数またはクロージャの代わりに使用できます。

source: Specifying Argument Labels
ja: 引数ラベルを指定する

source: Specifying Cleanup Actions
ja: クリーンアップ動作の指定

source: Square 3 contains the bottom of a ladder that moves you up to square 11.
ja: 正方形３は、正方形11まであなたを動かすはしごの底を含みます。

source: Squares with a ladder base have a positive number to move you up the board, whereas squares with a snake head have a negative number to move you back down the board.
ja: はしごの接地面がある正方形は、あなたを盤の上方に動かすために正の番号を持ちます、一方でヘビの頭のある正方形は、あなたを逆に盤の下に動かすために負の数を持ちます。

source: Statements
ja: 文

source: Static string literals can’t use features like string interpolation or concatenation, but they can use the multiline string literal syntax.
ja: 静的文字列リテラルは、文字列補間や連結のような機能を使えません、しかしそれらは複数行文字列リテラル構文を使えます。

source: Stopping execution as soon as an invalid state is detected also helps limit the damage caused by that invalid state.
ja: 無効な状態が検知されるやいなや実行を停止することはまた、その無効な状態によって起こされる被害を抑えます。

source: Stored Properties
ja: 格納プロパティ

source: Stored Properties and Instance Variables
ja: 格納プロパティとインスタンス変数

source: Stored Properties of Constant Structure Instances
ja: 定数構造体インスタンスの格納プロパティ

source: Stored Variable Observers and Property Observers
ja: 格納された変数オブザーバーとプロパティオブザーバー

source: Stored Variables and Stored Variable Properties
ja: 格納変数と格納変数プロパティ

source: Stored and computed properties are usually associated with instances of a particular type.
ja: 格納されるもしくは計算されるプロパティは、通常は特定の型のインスタンスに結び付けられます。

source: Stored properties are constants or variables that are bundled up and stored as part of the structure or class.
ja: 格納プロパティは、構造体またはクラスの一部としてまとめられて格納される定数または変数です。

source: Stored properties are provided only by classes and structures.
ja: 格納プロパティは、クラスと構造体だけで提供されます。

source: Stored properties can be either variable stored properties (introduced by the var keyword) or constant stored properties (introduced by the let keyword).
ja: 格納プロパティは、変数格納プロパティ（varキーワードによって導入される）か定数格納プロパティ（letキーワードによって導入される）であることができます。

source: Stored properties cannot be left in an indeterminate state.
ja: 格納プロパティは、不確定な状態のままにされることができません。

source: Stored properties store constant and variable values as part of an instance, whereas computed properties calculate (rather than store) a value.
ja: 格納プロパティは、あるインスタンスの一部として定数と変数の値を格納します、一方で、計算プロパティは、値を（たくわえておくのではなく）計算します。

source: Stored type properties are lazily initialized on their first access.
ja: 格納型プロパティは、それらの最初のアクセスにおいて遅延して初期化されます。

source: Stored type properties can be variables or constants.
ja: 格納プロパティは、変数または定数であることができます。

source: Stored variables, like stored properties, provide storage for a value of a certain type and allow that value to be set and retrieved.
ja: 格納変数は、格納プロパティの様に、保管場所を特定の型のひとつの値のために用意して、その値の設定と取得を可能にします。

source: Storing the number 10 into rectangle.height succeeds because it’s a small number.
ja: 数10をrectangle.heightへと格納することは成功します、なぜならそれは小さな数だからです。

source: Strictly speaking, initializers do not return a value.
ja: 厳密にいえば、イニシャライザは値を返しません。

source: Strictly speaking, this version of the greet(person:) function does still return a value, even though no return value is defined.
ja: 厳密に言って、たとえ戻り値が定義されないとしても、このバージョンのgreet(person:)関数は、まだ値を返します。

source: Strictly speaking, you can write a custom class that conforms to CounterDataSource without implementing either protocol requirement.
ja: 厳密に言って、あなたはCounterDataSourceに準拠する特注のクラスを書くことが両方のプロトコル要件を満たすことなく可能です。

source: String Indices
ja: 文字列インデックス

source: String Interpolation
ja: 文字列補間

source: String Literals
ja: 文字列リテラル

source: String Mutability
ja: 文字列の可変性

source: String and Character Equality
ja: 文字列と文字の同等性

source: String and character comparisons in Swift are not locale-sensitive.
ja: 文字列および文字の比較はスウィフトではロケールに影響されません。

source: String and character equality is checked with the “equal to” operator (==) and the “not equal to” operator (!=), as described in Comparison Operators:
ja: 文字列と文字の同等性は、「同等」演算子（==）および「不等」演算子（!=）で調べられます、これは比較演算子で記述されます：

source: String literals can include the following special characters:
ja: 文字列リテラルは、以下の特別な文字を含むことができます：

source: String literals can’t contain an unescaped double quotation mark ("), an unescaped backslash (\), a carriage return, or a line feed.
ja: 文字列リテラルは、エスケープされない二重引用符（"）、エスケープされないバックスラッシュ（\）、キャリッジリターン、またはラインフィードを含むことが出来ません。

source: String literals created using extended delimiters can also be multiline string literals.
ja: 拡張区切り文字を使って作成される文字列リテラルは、また複数行文字列リテラルであることができます。

source: String literals that are concatenated by the + operator are concatenated at compile time.
ja: +演算子によって連結される文字列リテラルは、コンパイル時に連結されます。

source: Strings Are Value Types
ja: 文字列は値型です

source: Strings and Characters
ja: 文字列と文字

source: Strong Reference Cycles Between Class Instances
ja: クラスインスタンス間の強い参照循環

source: Strong Reference Cycles for Closures
ja: クロージャのための強い参照循環

source: Structure Declaration
ja: 構造体宣言

source: Structure and Class Instances
ja: 構造体とクラスのインスタンス

source: Structure and enumeration methods that modify self or its properties must mark the instance method as mutating, just like mutating methods from an original implementation.
ja: selfまたはそのプロパティを修正する構造および列挙メソッドは、ちょうど最初の実施からの変更メソッドのように、そのインスタンスメソッドにmutatingとして印されなければなりません。

source: Structure declarations are declared using the struct keyword and have the following form:
ja: 構造体宣言は、キーワードstructを使って宣言されて、以下の形式を持ちます：

source: Structure declarations can’t contain deinitializer or protocol declarations.
ja: 構造宣言は、デイニシャライザまたはプロトコル宣言を含むことができません。

source: Structure types automatically receive a memberwise initializer if they don’t define any of their own custom initializers.
ja: 構造体型は、それが独自のあつらえのイニシャライザを何ら定義しないならば、自動的にメンバー関連イニシャライザを受け取ります。

source: Structure types can adopt any number of protocols, but can’t inherit from classes, enumerations, or other structures.
ja: 構造体型は、随意の数のプロトコルに準拠することができます、しかしクラス、列挙、または他の構造体から継承することはできません。

source: Structure, enumeration, and class types can have any number of initializers, but the rules and associated behavior for class initializers are different.
ja: 構造体、列挙、そしてクラス型は、随意の数のイニシャライザを持つことができます、しかし、クラスイニシャライザのための規則および関連する挙動は異なります。

source: Structures and Classes
ja: 構造体とクラス

source: Structures and Enumerations Are Value Types
ja: 構造体と列挙は値型です

source: Structures and classes both use initializer syntax for new instances.
ja: 構造体とクラスは両方とも、新しいインスタンスのためにイニシャライザ構文を使います。

source: Structures and classes have a similar definition syntax.
ja: 構造体とクラスは、類似した定義構文を持ちます。

source: Structures and classes in Swift have many things in common.
ja: スウィフトでの構造体とクラスは、多くのものを共通して持ちます。

source: Structures and enumerations are value types.
ja: 構造体と列挙は、値型です。

source: Structures and enumerations are value types, not reference types, and are not stored and passed by reference.
ja: 構造と列挙は値型であって、参照型ではありません、そして参照によって格納されたり渡されたりしません。

source: Structures and enumerations that conform to the protocol declare the method with the static keyword, and classes that conform to the protocol declare the method with either the static or class keyword.
ja: そのプロトコルに準拠する構造体と列挙は、staticキーワードでメソッドを宣言します、そしてそのプロトコルに準拠するクラスは、staticまたはclassキーワードのどちらかでメソッドを宣言します。

source: Structures and enumerations that conform to the protocol declare the property with the static keyword, and classes that conform to the protocol declare the property with either the static or class keyword.
ja: そのプロトコルに準拠する構造体と列挙は、staticキーワードでプロパティを宣言します、そしてそのプロトコルに準拠するクラスは、staticまたはclassキーワードのどちらかでプロパティを宣言します。

source: Structures and enumerations that conform to the protocol declare the subscript with the static keyword, and classes that conform to the protocol declare the subscript with either the static or class keyword.
ja: そのプロトコルに準拠する構造体と列挙は、staticキーワードで添え字を宣言します、そしてそのプロトコルに準拠するクラスは、staticまたはclassキーワードのどちらかで添え字を宣言します。

source: Structures are value types; instances of a structure are copied when assigned to variables or constants, or when passed as arguments to a function call.
ja: 構造体は、値型です；構造体のインスタンスは、変数や定数に代入される時、または関数呼び出しの引数として渡される時にコピーされます。

source: Structures support many of the same behaviors as classes, including methods and initializers.
ja: 構造体は、クラスと同じ挙動の多くを、メソッドとイニシャライザも含めてサポートします。

source: Structures that have only stored properties that conform to the Equatable protocol
ja: Equatableプロトコルに準拠する格納プロパティだけを持つ構造体

source: Subclasses can modify inherited variable properties during initialization, but can not modify inherited constant properties.
ja: サブクラスは、初期化の間に継承された変数プロパティを修正することできます、しかし継承された定数プロパティを変更することはできません。

source: Subclasses can themselves be subclassed.
ja: サブクラスは、それ自身サブクラスを作られることが出来ます。

source: Subclasses can use a superclass expression in their implementation of members, subscripting, and initializers to make use of the implementation in their superclass.
ja: サブクラスは、そのメンバー、添え字、そしてイニシャライザの実装においてスーパークラス式を使うことで、それらのスーバークラス内の実装を活用することができます。

source: Subclasses include their superclass name after their class name, separated by a colon.
ja: サブクラスたちはそれらのクラス名の後に、コロンで区切られて、それらのスーパークラス名を含みます。

source: Subclassing
ja: サブクラスをつくる

source: Subscript Declaration
ja: 添え字宣言

source: Subscript Expression
ja: 添え字式

source: Subscript Options
ja: 添え字オプション

source: Subscript Syntax
ja: 添え字の構文

source: Subscript Usage
ja: 添え字の使用法

source: Subscript declarations are declared using the subscript keyword and have the following form:
ja: 添え字宣言は、キーワードsubscriptを使って宣言されて、以下の形式を持ちます：

source: Subscript declarations can appear only in the context of a class, structure, enumeration, extension, or protocol declaration.
ja: 添え字宣言は、クラス、構造体、列挙、拡張、またはプロトコル宣言の文脈においてだけ、現れることができます。

source: Subscript declarations only declare the minimum getter and setter implementation requirements for types that conform to the protocol.
ja: 添え字宣言は、プロトコルに準拠する型のための最小限のゲッターとセッター実装要件を宣言するだけです。

source: Subscript parameters follow the same rules as function parameters, with two exceptions.
ja: 添え字パラメータは、関数パラメータと同じ規則に従います、２つの例外で。

source: Subscripts
ja: 添え字

source: Subscripts are not limited to a single dimension, and you can define subscripts with multiple input parameters to suit your custom type’s needs.
ja: 添え字は１つの次元に制限されません、なのであなたは複数の入力パラメータをもつ添え字を定義して、あなたのあつらえの型の必要を満たすことが出来ます。

source: Subscripts are typically used as a shortcut for accessing the member elements in a collection, list, or sequence.
ja: 添え字は、一般的に、コレクション、リスト、またはシーケンスの中のメンバー要素にアクセスするための近道として使われます。

source: Subscripts can also return a value of any type.
ja: 添え字はまた、任意の型の値を返すことができます。

source: Subscripts can be generic, and they can include generic where clauses.
ja: 添え字は総称体であることができます、そしてそれらは総称体where節を含むことができます。

source: Subscripts can take any number of input parameters, and these input parameters can be of any type.
ja: 添え字は、任意の数の入力パラメータをとることができます、そしてこれらの入力パラメータはどんな型でもかまいません。

source: Subscripts enable you to query instances of a type by writing one or more values in square brackets after the instance name.
ja: 添え字は、あなたにそのインスタンス名の後で角括弧の中に１つ以上の値を書くことによって、ある型のインスタンスに問い合わせることを可能にします。

source: Substrings
ja: 下位文字列

source: Substrings in Swift have most of the same methods as strings, which means you can work with substrings the same way you work with strings.
ja: スウィフトでの下位文字列は、文字列とほとんど同じメソッドを持ちます、それはあなたが下位文字列を、文字列を扱うのと同じ方法で扱えることを意味します。

source: Subtracting 1 from this binary number with the overflow operator gives a binary value of 01111111, which toggles the sign bit and gives positive 127, the maximum positive value that an Int8 can hold.
ja: この２進数からオーバフロー演算子を使って1を減ずることは、２進数の01111111を与えます、それは符号ビットを切り替えて正の127、Int8が持つことができる最大限の正の値、を与えます。

source: Subtraction (-)
ja: 減算（-）

source: Such properties are known as type properties.
ja: そのようなプロパティは、型プロパティとして知られています。

source: Summary of the Grammar
ja: 文法の概要

source: Superclass Expression
ja: スーパークラス式

source: Superclass deinitializers are always called, even if a subclass does not provide its own deinitializer.
ja: スーパークラスのデイニシャライザは、たとえサブクラスがそれ自身のデイニシャライザを提供しないとしても、常に呼ばれます。

source: Superclass deinitializers are inherited by their subclasses, and the superclass deinitializer is called automatically at the end of a subclass deinitializer implementation.
ja: スーパークラスのデイニシャライザは、それらのサブクラスたちによって継承されます、そして、スーパークラスのデイニシャライザはサブクラスのデイニシャライザ実施の終わりに自動的に呼ばれます。

source: Superclass initializers are inherited in certain circumstances, but only when it is safe and appropriate to do so.
ja: スーパークラスのイニシャライザはある特定の状況において継承されます、しかしそれが安全にそして適切にそうできる時だけです。

source: Swift allows this memory-safe code if the compiler can prove that the nonexclusive access to memory is still safe.
ja: スウィフトは、メモリへの非排他アクセスが依然として安全であるとコンパイラが立証できるならば、このメモリ安全コードを許可します。

source: Swift also handles all memory management involved in disposing of variables when they are no longer needed.
ja: スウィフトはまた、それがもはや必要とされないとき変数を処分することに関わるすべての記憶管理を取り扱います。

source: Swift also introduces optional types, which handle the absence of a value.
ja: スウィフトはまたオプショナルの型を導入します、それは値の欠如を取り扱います。

source: Swift also makes extensive use of variables whose values can’t be changed.
ja: スウィフトはまた、それの値が変更されることができない変数を広範囲に利用します。

source: Swift also makes sure that multiple accesses to the same area of memory don’t conflict, by requiring code that modifies a location in memory to have exclusive access to that memory.
ja: スウィフトはまた、同じメモリ領域に対する複数のアクセスが衝突しないことを、メモリ中の位置を修正するコードにそのメモリに対する排他的アクセスを持つよう要求することによって確保します。

source: Swift also provides unsafe unowned references for cases where you need to disable runtime safety checks—for example, for performance reasons.
ja: スウィフトはまたunsafe非所有参照を、あなたが実行時安全確認を無効にする必要がある場合のために提供します — 例えば、性能上の理由のために。

source: Swift also provides a for-in loop that makes it easy to iterate over arrays, dictionaries, ranges, strings, and other sequences.
ja: スウィフトはまた、for-inループを提供します、それは、配列、辞書、範囲、文字列、およびその他のシーケンス（連続したもの）の全体にわたって繰り返し処理するのを簡単にします。

source: Swift also provides an unsigned integer type, UInt, which has the same size as the current platform’s native word size:
ja: スウィフトはまた、符号なし整数型、UIntを提供します、そしてそれは、現在のプラットホーム固有のワードサイズと同じ大きさを持ちます：

source: Swift also provides powerful versions of the three primary collection types, Array, Set, and Dictionary, as described in Collection Types.
ja: スウィフトはまた、３つの主要なコレクション型、Array、Set、そしてDictionaryの強力なバージョンを提供します、それは「コレクション型」で記述されます。

source: Swift also provides range operators that aren’t found in C, such as a..<b and a...b, as a shortcut for expressing a range of values.
ja: スウィフトはまた、Cでは見られない範囲演算子、例えばa..<bとa...bを、値の範囲を表す近道として提供します。

source: Swift also provides two identity operators (=== and !==), which you use to test whether two object references both refer to the same object instance.
ja: スウィフトはまた、２つの同一性演算子を提供します（===と!==）、それはあなたが２つのオブジェクト参照が両方とも同じオブジェクト・インスタンスに言及するかどうかについて調べるために使います。

source: Swift always chooses Double (rather than Float) when inferring the type of floating-point numbers.
ja: 浮動小数点数の型を推論するとき、スウィフトは常にDoubleを選びます（Floatではなく）。

source: Swift automatically deallocates your instances when they are no longer needed, to free up resources.
ja: スウィフトは自動的に、それらがもはや必要とされない場合はあなたのインスタンスを割り当て解除して、資源を自由に使えるようにします。

source: Swift automatically propagates errors out of their current scope until they’re handled by a catch clause.
ja: スウィフトは自動的に、エラーをそれの現在のスコープの外に、それがcatch節によって取り扱われるまで伝えます。

source: Swift automatically provides shorthand argument names to inline closures, which can be used to refer to the values of the closure’s arguments by the names $0, $1, $2, and so on.
ja: スウィフトは行内クロージャに自動的に短縮形引数名を提供します、そしてそれは、名前$0、$1、$2、などにでクロージャの引数の値に言及するために使われることができます。

source: Swift can infer associated types, which lets you use an opaque return value in places where a protocol type can’t be used as a return value.
ja: スウィフトは関連型を推論できます、それはあなたに不透明戻り値を、プロトコル型が戻り値として使われることができないところあちこちで使用させます。

source: Swift can therefore infer that Element is the appropriate type to use as the Item for this particular container.
ja: スウィフトは、したがってElementが、この特定のコンテナのためのItemとして使うのに適当な型であると推測することができます。

source: Swift classes do not inherit from a universal base class.
ja: スウィフトのクラスたちは、ひとつの共通の基盤クラスから継承はしません。

source: Swift code is compiled and optimized to get the most out of modern hardware.
ja: スウィフトコードは、モダンなハードウェアを最大限活用するようにコンパイルおよび最適化されます。

source: Swift combines powerful type inference and pattern matching with a modern, lightweight syntax, allowing complex ideas to be expressed in a clear and concise manner.
ja: スウィフトは、強力な型インターフェイスおよびパターンマッチングをモダンで、軽量な構文と結び付けて、複雑なアイデアが明瞭で簡潔な流儀で表されるようにしています。

source: Swift defines a Never type, which indicates that a function or method doesn’t return to its caller.
ja: スウィフトはNever型を定義します、それはある関数またはメソッドがそれの呼び出し側に帰らないことを指し示します。

source: Swift defines away large classes of common programming errors by adopting modern programming patterns:
ja: スウィフトは、よくあるプログラミング過失のうちの主要な種類を、以下のモダンなプログラミングパターンを採用することによって遠ざけます：

source: Swift defines numerous precedence groups to go along with the operators provided by the standard library.
ja: スウィフトは、標準ライブラリによって提供される演算子と一緒にやっていくために、多数の優先順位グループを定義します。
